iarsystems/ewarm-toshiba-example-projects/TMPM3HP/Libraries/CMSIS/startup/iar/startup_TMPM3HP.s
                PUBWEAK INTT32A03CCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A03CCAP0_IRQHandler
                B       INTT32A03CCAP0_IRQHandler

                PUBWEAK INTT32A03CCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A03CCAP1_IRQHandler
                B       INTT32A03CCAP1_IRQHandler

                PUBWEAK INTT32A04A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A04A_IRQHandler
                B       INTT32A04A_IRQHandler

                PUBWEAK INTT32A04ACAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A04ACAP0_IRQHandler
                B       INTT32A04ACAP0_IRQHandler

                PUBWEAK INTT32A04ACAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A04ACAP1_IRQHandler
                B       INTT32A04ACAP1_IRQHandler

                PUBWEAK INTT32A04B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A04B_IRQHandler
                B       INTT32A04B_IRQHandler

                PUBWEAK INTT32A04BCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A04BCAP0_IRQHandler
                B       INTT32A04BCAP0_IRQHandler

                PUBWEAK INTT32A04BCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A04BCAP1_IRQHandler
                B       INTT32A04BCAP1_IRQHandler

                PUBWEAK INTT32A04C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A04C_IRQHandler
                B       INTT32A04C_IRQHandler

                PUBWEAK INTT32A04CCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A04CCAP0_IRQHandler
                B       INTT32A04CCAP0_IRQHandler

                PUBWEAK INTT32A04CCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A04CCAP1_IRQHandler
                B       INTT32A04CCAP1_IRQHandler

                PUBWEAK INTT32A05A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A05A_IRQHandler
                B       INTT32A05A_IRQHandler

                PUBWEAK INTT32A05ACAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A05ACAP0_IRQHandler
                B       INTT32A05ACAP0_IRQHandler

                PUBWEAK INTT32A05ACAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A05ACAP1_IRQHandler
                B       INTT32A05ACAP1_IRQHandler

                PUBWEAK INTT32A05B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A05B_IRQHandler
                B       INTT32A05B_IRQHandler

                PUBWEAK INTT32A05BCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A05BCAP0_IRQHandler
                B       INTT32A05BCAP0_IRQHandler

                PUBWEAK INTT32A05BCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A05BCAP1_IRQHandler
                B       INTT32A05BCAP1_IRQHandler

                PUBWEAK INTT32A05C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A05C_IRQHandler
                B       INTT32A05C_IRQHandler

                PUBWEAK INTT32A05CCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A05CCAP0_IRQHandler
                B       INTT32A05CCAP0_IRQHandler

                PUBWEAK INTT32A05CCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A05CCAP1_IRQHandler
                B       INTT32A05CCAP1_IRQHandler

                PUBWEAK INTT32A06A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A06A_IRQHandler
                B       INTT32A06A_IRQHandler

                PUBWEAK INTT32A06ACAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A06ACAP0_IRQHandler
                B       INTT32A06ACAP0_IRQHandler

                PUBWEAK INTT32A06ACAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A06ACAP1_IRQHandler
                B       INTT32A06ACAP1_IRQHandler

                PUBWEAK INTT32A06B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A06B_IRQHandler
                B       INTT32A06B_IRQHandler

                PUBWEAK INTT32A06BCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A06BCAP0_IRQHandler
                B       INTT32A06BCAP0_IRQHandler

                PUBWEAK INTT32A06BCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A06BCAP1_IRQHandler
                B       INTT32A06BCAP1_IRQHandler

                PUBWEAK INTT32A06C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A06C_IRQHandler
                B       INTT32A06C_IRQHandler

                PUBWEAK INTT32A06CCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A06CCAP0_IRQHandler
                B       INTT32A06CCAP0_IRQHandler

                PUBWEAK INTT32A06CCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A06CCAP1_IRQHandler
                B       INTT32A06CCAP1_IRQHandler

                PUBWEAK INTT32A07A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07A_IRQHandler
                B       INTT32A07A_IRQHandler

                PUBWEAK INTT32A07ACAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07ACAP0_IRQHandler
                B       INTT32A07ACAP0_IRQHandler

                PUBWEAK INTT32A07ACAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07ACAP1_IRQHandler
                B       INTT32A07ACAP1_IRQHandler

                PUBWEAK INTT32A07B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07B_IRQHandler
                B       INTT32A07B_IRQHandler

                PUBWEAK INTT32A07BCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07BCAP0_IRQHandler
                B       INTT32A07BCAP0_IRQHandler

                PUBWEAK INTT32A07BCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07BCAP1_IRQHandler
                B       INTT32A07BCAP1_IRQHandler

                PUBWEAK INTT32A07C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07C_IRQHandler
                B       INTT32A07C_IRQHandler

                PUBWEAK INTT32A07CCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07CCAP0_IRQHandler
                B       INTT32A07CCAP0_IRQHandler

